In [1]:
import pandas as pd

In [19]:
json_sv=[
{
    'name': 'Nguyễn Đỗ Thanh Thùy',
    'class': 'K19406C',
    'birthday': {
        'year': 2001,
        'month': 11,
        'day': 1
    },
    'province': 'Quảng Ngãi',
    'gender': False
},
{
    'name': 'Bùi Thái Minh',
    'class': 'K19406C',
    'birthday': 2001,
    'province': 'Thái Bình',
    'gender': True,
    'code': 'K15411106'
}]
print(type(json_sv))
print(json_sv[1]['gender'])

<class 'list'>
True

In [20]:
df_sv = pd.json_normalize(json_sv)
df_sv

,name,class,province,gender,birthday.year,birthday.month,birthday.day,birthday,code
0,Nguyễn Đỗ Thanh Thùy,K19406C,Quảng Ngãi,False,2001.0,11.0,1.0,NaN,NaN
1,Bùi Thái Minh,K19406C,Thái Bình,True,NaN,NaN,NaN,2001.0,K15411106

In [47]:
json_httt=[
    {
    'class': 'K19406C',
    'students':[
        {
            'name': 'A',
            'gender': True
        },
        {
            'name': 'B',
            'gender': False
        },
        {
            'name': 'C'
        }]
    },
    {
    'class': 'K19411',
    'students':[
        {
            'name': 'A',
            'gender': True
        },
        {
            'name': 'B',
            'gender': False
        },
        {
            'name': 'C'
        }]
    },
]
df_httt = pd.json_normalize(json_httt, record_path=['students'], meta=['class'])
df_httt

  name gender    class
0    A   True  K19406C
1    B  False  K19406C
2    C    NaN  K19406C
3    A   True   K19411
4    B  False   K19411
5    C    NaN   K19411

In [52]:
df_httt.groupby('class')['name'].count()

class
K19406C    3
K19411     3
Name: name, dtype: int64

In [62]:
df_sv =pd.json_normalize(json_httt)
df_sv['student_count'] = df_sv['students'].apply(lambda x : len(x))
df_sv

     class                                           students  student_count
0  K19406C  [{'name': 'A', 'gender': True}, {'name': 'B', ...              3
1   K19411  [{'name': 'A', 'gender': True}, {'name': 'B', ...              3